pengnianchun/Fangyan-dspic30f6012A-299/中坤客车-山东沂新/299-xxx-ShanDongYiXinZhongKun/src/SYSTEM.h
#define CAN_TIME 30//CAN节点故障报警
#define BAT24_TIME 100//蓄电池电压过低报警10秒

extern unsigned int fFreq; //前模块频率
extern unsigned int mFreq; //中（顶）模块频率
extern unsigned int rFreq; //后模块频率
extern unsigned int fSpeed; //前模块折算车速
extern unsigned int mSpeed; //中（顶）模块折算车速
extern unsigned int rSpeed; //后模块折算车速
extern unsigned int fADR[2]; //前模块电阻值
extern unsigned int mADR[2]; //中（顶）模块电阻值
extern unsigned int rADR[2]; //后模块电阻值
extern DBCM_POUT fPOUT; //前模块功率输出状态
extern DBCM_POUT mPOUT; //中（顶）模块功率输出状态
extern DBCM_POUT rPOUT; //后模块功率输出状态
extern unsigned char fPF[16]; //前模块功率输出故障
extern unsigned char mPF[16]; //中（顶）模块功率故障
extern unsigned char rPF[16]; //后模块功率输出故障
extern unsigned int fpcur[15];//前模块功率输出电流
extern unsigned int mpcur[15];//中模块功率输出电流
extern unsigned int rpcur[15];//后模块功率输出电流

extern unsigned int ADR[8]; //模拟量采集   2016/10/15
extern unsigned int ADV[8];
//extern unsigned char Count30s;
//extern const unsigned char BMP_LOGO[];
//extern const unsigned char BMP_LOGObmp[];

/**********随州协议变量************/
extern unsigned int Moto_Voltage; //电机电压
extern unsigned int Moto_Current; //电机电流
extern unsigned int Moto_Rpm; //电机转速
extern unsigned char Motor_Temperature; //电机温度
extern unsigned char Inverter_t; //控制器温度

extern unsigned long Program; //程序版本
extern unsigned char Car_Mode; //整车模式
extern unsigned char Car_Fault_Level;//故障等级
extern unsigned int  Fault_Code;//故障代码
extern unsigned char Car_LIFE; //整车控制器

extern DATA_BIT MET_C_3[2];
#define  Kt_1             MET_C_3[0].bit1
#define  Kt_0             MET_C_3[0].bit2  
#define  Kt_Charge        MET_C_3[0].bit3  
#define  Kt_Defrost       MET_C_3[0].bit4  
#define  Kt_AC            MET_C_3[0].bit5  

#define  Brake_Ele        MET_C_3[1].bit4
#define  READY            MET_C_3[1].bit5
extern unsigned char DCDC_Sanreqi_t; //DCDC散热器温度
extern unsigned char DCDC_Warn_code; //DCDC故障代码
extern unsigned char DCAC1_Sanreqi_t; //DCAC1散热器温度
extern unsigned char DCAC1_Warn_code; //DCAC1故障代码
extern unsigned char DCAC2_Sanreqi_t; //DCAC2散热器温度
extern unsigned char DCAC2_Warn_code; //DCAC2故障代码

extern DATA_BIT MET_C_4[3];
#define  Gear_D           MET_C_4[0].bit3
#define  Gear_R           MET_C_4[0].bit4  
#define  Gear_N           MET_C_4[0].bit5  

#define  Park             MET_C_4[1].bit4
#define  Press_Low        MET_C_4[1].bit7  
extern unsigned char Over_Speed; //超速报警
extern unsigned char Speed_Percent1; //加速踏板1开度
extern unsigned char Speed_Percent2; //加速踏板2开度
extern unsigned char Brake_Percent1; //制动踏板1开度
extern unsigned char Brake_Percent2; //制动踏板2开度

extern unsigned int  Oum_zheng; //绝缘正阻值
extern unsigned int  Oum_fu;    //绝缘负阻值
extern unsigned char Oum_Warn;  //整车绝缘报警

//BMS1_S_1
extern unsigned char BMS_SOC; //电池SOC
extern unsigned int  BMS_V; //电池电压
extern unsigned int  BMS_A; //电池电流
extern unsigned int  BAT_Number;//电池组总串数
extern unsigned char BMS_Life; //BMSlife

//BMS1_S_3
extern DATA_BIT BMS1_S_3[3];
#define  BMU_OFFLINE           BMS1_S_3[0].bit1
#define  CHARGER_COMM_FAULT    BMS1_S_3[0].bit2  
#define  PRECHARGE_FAULT       BMS1_S_3[0].bit3 
#define  BALANCE_FAULT         BMS1_S_3[0].bit4
#define  WARN_FAULT            BMS1_S_3[0].bit5 
#define  BAT_COOL_FAULT        BMS1_S_3[0].bit6
#define  BMS_FAULT_OTHER       BMS1_S_3[0].bit7
#define  BMS_COMM_FAULT        BMS1_S_3[0].bit8  

#define  CHARGE_PLUG           BMS1_S_3[1].bit4
#define  CHARGE_STATUS         BMS1_S_3[1].bit5 
#define  BAT_FAULT             BMS1_S_3[1].bit6
extern unsigned char BMS_Self_Check;//BMS自检状态

#define  TEMP_COLT_OFFLINE     BMS1_S_3[2].bit1
#define  BAT_CELL_COLT_OFFLINE BMS1_S_3[2].bit2  
#define  SOC_JUMP              BMS1_S_3[2].bit4
#define  SYSTEM_MISMATCH       BMS1_S_3[2].bit5 
#define  FIRE_FAULT            BMS1_S_3[2].bit6
#define  VOLTAGE_DIFF_FAULT    BMS1_S_3[2].bit7

extern unsigned char Battery_OverTemp;//电池高温报警
extern unsigned char Pole_OverTemp;//极柱高温报警
extern unsigned char Single_Bat_OverVoltage;//单体过压报警
extern unsigned char Pack_Bat_OverVoltage;//电池组过压报警
extern unsigned char Pack_Bat_UnderVoltage;//电池组欠压报警
extern unsigned char Single_Bat_UnderVoltage;//单体欠压报警
extern unsigned char Charge_Gun_OverTemp;//充电枪过温报警
extern unsigned char Bat_Fault;//动力电池故障
extern unsigned char Discharge_OverCurrent;//放电过流报警
extern unsigned char Charge_OverCurrent;//充电过流报警
extern unsigned char Diff_Voltage;//单体电压差异报警
extern unsigned char Diff_Temp;//温度差异报警
extern unsigned char SOC_Low;//SOC低报警
extern unsigned char SOC_High;//SOC高报警
extern unsigned char Diff_SOC;//SOC差异报警
extern unsigned char Bat_LowTemp;//电池温度低报警

//BMS单体电池数据
extern unsigned int  BAT_Max_Cell_Voltage[4]; //电池单体高电压
extern unsigned char BAT_Max_Cell_Voltage_Cell_Case[4]; //最高单体电压箱号
extern unsigned char BAT_Max_Cell_Voltage_Cell_Number[4]; //最低单体电压位置

extern unsigned int  BAT_Min_Cell_Voltage[4]; //电池单体高电压
extern unsigned char BAT_Min_Cell_Voltage_Cell_Case[4]; //最高单体电压箱号
extern unsigned char BAT_Min_Cell_Voltage_Cell_Number[4]; //最低单体电压位置

extern unsigned int  BAT_Max_Cell_Temperature[4]; //最高单体温度
extern unsigned char BAT_Max_Cell_Temp_Cell_Case[4]; //最高单体温度箱号

extern unsigned int  BAT_Min_Cell_Temperature[4]; //最低单体温度
extern unsigned char BAT_Min_Cell_Temp_Cell_Case[4]; //最低单体温度箱号

extern unsigned char BAT_Pole_Temperature_P[16];//正极柱温度
extern unsigned char BAT_Pole_Temperature_N[16];//负极柱温度
/*
extern unsigned int  VCU_TM_NM; //TM目标扭矩
extern unsigned int  VCU_TM_RPM; //TM目标转速

extern unsigned char VCU_TM_Brake_percent; //制动踏板开度
extern unsigned char VCU_TM_Speed_percent; //加速踏板开度
extern unsigned char VCU_Status_Flag1;//状态1
extern unsigned char VCU_Gear;//档位
extern unsigned char VCU_Fault;//车辆系统故障
extern DATA_BIT VCU_Status_Flag2[1];
#define  READY            VCU_Status_Flag2[0].bit3
#define  BMS_OFFLINE      VCU_Status_Flag2[0].bit4  
#define  ISG_OFFLINE      VCU_Status_Flag2[0].bit5  
#define  TM_OFFLINE       VCU_Status_Flag2[0].bit6  
#define  CHARGE_OVERTIME  VCU_Status_Flag2[0].bit7  
#define  CAR_LOCK         VCU_Status_Flag2[0].bit8    
extern unsigned char VCU_Life;//整车控制器LIFE

extern unsigned int  TM_Feedback_RPM;//TM电机反馈转速
extern unsigned int  TM_Feedback_NM;//TM电机反馈扭矩
extern unsigned char TM_WorkStatus;//TM电机工作状态

extern unsigned char TM_Temp;//TM电机温度
extern unsigned char TM_Control_Temp;//TM电机控制器温度
extern unsigned char TM_Fault;//TM电机故障等级

extern unsigned int  TM_Current_DC;//TM电机直流电流
extern unsigned int  TM_Voltage_DC;//TM电机直流电压

extern unsigned char VCU_Kt; //主接触器控制命令
extern unsigned char VCU_ON; //钥匙下电状态
extern unsigned char VCU_Order; //故障处理命令
extern unsigned int  VCU_Voltage; //电机控制器电压

extern unsigned char BMS_Status;//电池状态
extern unsigned char BMS_Fault; //故障状态
extern unsigned char BMS_Balance_Lock;//电池均衡锁定状态
extern unsigned char BMS_Fault_Lock;//故障锁定状态
extern unsigned char BMS_SOC;//SOC
extern unsigned char BMS_SOH;//SOH
extern unsigned char BMS_Ahr;//电池容量
extern unsigned int  BMS_Ohm;//电池系统内阻
extern unsigned char BMS_Life;//生命信号

extern unsigned int  BMS_Voltage;//电池系统内总电压
extern unsigned int  BMS_OutVoltage;//电池系统输出电压
extern unsigned int  BMS_Current;//电池系统电流
extern unsigned int  BMS_Power;//电池系统功率
extern unsigned char BMS_Temp;//环境温度

extern unsigned int  BMS_TotalVoltage; //单体电池电压总和
extern unsigned int  Battery_Single_H; //电池单体高电压
extern unsigned int  Battery_Single_L; //电池单体低电压
extern unsigned char Battery_Single_H_Number; //电池单体高电压位置
extern unsigned char Battery_Single_L_Number; //电池单体低电压箱号

extern unsigned int  Battery_Temp_Average; //电池平均温度
extern unsigned int  Battery_Temp_H; //电池单体最高温度
extern unsigned int  Battery_Temp_L; //电池单体最低温度
extern unsigned char Battery_Temp_H_Number; //电池单体高温度序号
extern unsigned char Battery_Temp_L_Number; //电池单体低温度序号

