pengnianchun/Fangyan-dspic30f6012A-299/中坤客车-山东沂新/299-xxx-ShanDongYiXinZhongKun/src/SYSTEM.h
extern unsigned int  Battery_Voltage_H_Limit;//电池系统最高电压限制
extern unsigned int  Battery_Voltage_L_Limit;//电池系统最低电压限制
extern unsigned int  Battery_Single_Voltage_H_Limit;//电池单体最高电压限制
extern unsigned int  Battery_Single_Voltage_L_Limit;//电池单体最低电压限制
extern unsigned char Battery_Current_Discharge_Limit;//最高允许放电电流
extern unsigned char Battery_Current_Charge_Limit;//最高允许充电电流

extern unsigned char BMS_SOC_H_Limit;//最高允许SOC值
extern unsigned char BMS_SOC_L_Limit;//最低允许SOC值
extern unsigned char BMS_Power_10s_Discharge_Limit;//10s 最高允许放电功率
extern unsigned char BMS_Power_10s_Charge_Limit;//10s 最高允许充电功率
extern unsigned char Battery_Temp_H_Limit; //最高允许电池单体温度
extern unsigned char Battery_Temp_L_Limit; //最低允许电池单体温度

extern unsigned long BMS_spn; //BMS故障码
extern unsigned char BMS_fmi;
extern unsigned char BMS_cm;
extern unsigned char BMS_oc;

extern unsigned int  DCDC_Voltage; //DCDC输出电压
extern unsigned int  DCDC_Current; //DCDC输出电流
extern unsigned char DCDC_Status; //DCDC工作状态
extern unsigned char DCDC_Output_Cut; //DCDC 输出切断
extern unsigned char DCDC_intput_Cut; //DCDC 输入切断
extern unsigned char DCDC_BasicStatus; //DCDC基本状态
extern unsigned char DCDC_Level_Fault; //DCDC故障等级
extern unsigned char DCDC_Temp; //DCDC模块温度

extern unsigned int  OILDCAC_U_Voltage; //DCAC输出U电压
extern unsigned int  OILDCAC_U_Current; //DCAC输出U电流
extern unsigned char OILDCAC_Status; //DCAC工作状态
extern unsigned char OILDCAC_Output_Cut; //DCAC 输出切断
extern unsigned char OILDCAC_intput_Cut; //DCAC 输入切断
extern unsigned char OILDCAC_BasicStatus; //DCAC基本状态
extern unsigned char OILDCAC_Level_Fault; //DCAC故障等级
extern unsigned char OILDCAC_Fault_Code; //DCAC故障代码
extern unsigned char OILDCAC_Temp; //DCAC模块温度

extern unsigned int  OILDCAC_V_Voltage; //DCAC输出V电压
extern unsigned int  OILDCAC_V_Current; //DCAC输出V电流
extern unsigned int  OILDCAC_W_Voltage; //DCAC输出W电压
extern unsigned int  OILDCAC_W_Current; //DCAC输出W电流

extern unsigned int  AIRDCAC_U_Voltage; //DCAC输出U电压
extern unsigned int  AIRDCAC_U_Current; //DCAC输出U电流
extern unsigned char AIRDCAC_Status; //DCAC工作状态
extern unsigned char AIRDCAC_Output_Cut; //DCAC 输出切断
extern unsigned char AIRDCAC_intput_Cut; //DCAC 输入切断
extern unsigned char AIRDCAC_BasicStatus; //DCAC基本状态
extern unsigned char AIRDCAC_Level_Fault; //DCAC故障等级
extern unsigned char AIRDCAC_Fault_Code; //DCAC故障代码
extern unsigned char AIRDCAC_Temp; //DCAC模块温度

extern unsigned int  AIRDCAC_V_Voltage; //DCAC输出V电压
extern unsigned int  AIRDCAC_V_Current; //DCAC输出V电流
extern unsigned int  AIRDCAC_W_Voltage; //DCAC输出W电压
extern unsigned int  AIRDCAC_W_Current; //DCAC输出W电流
*/
/**********************************************/

/*extern unsigned int moto_voltage; //电机电压
extern unsigned int moto_current; //电机电流
extern unsigned int moto_speed; //电动转速
extern unsigned char Motor_Temperature; //电机温度
extern unsigned char Inverter_t; //逆变器温度

extern unsigned char Accelerator; //油门开度
extern unsigned int Engine_Speed;//发动机转速

extern unsigned int Fule_rate;//油耗
extern unsigned char water_temp;//水温
extern unsigned char Engine_Fuhe;//发动机负荷
extern unsigned char Niaosu;//尿素;
extern unsigned char Accelerator_Shiji; //油门踏板实际
extern unsigned char Engine_oil_press; //机油压力
extern unsigned char ambient_air_temperature; //周围空气温度

extern unsigned char Current_Gear; //档位
extern unsigned char TCU_Position;//离合位置
extern unsigned char TCU_warn;//变速箱故障
extern unsigned char STOP;//停车故障
extern unsigned int Speed_rmp; //输出轴转速
extern unsigned char Car_mode;//整车模式
extern unsigned char TCU_code;//变速箱故障代码
extern unsigned char TCU_level;//变速箱故障等级

extern DATA_BIT CAN_KEY[4];
#define  CAN_ON           CAN_KEY[0].bit1
#define  CAN_ACC          CAN_KEY[0].bit2  
#define  Diagnosis        CAN_KEY[0].bit3  
#define  Mode_S           CAN_KEY[0].bit4  
#define  AC               CAN_KEY[0].bit5  
#define  Hybrid           CAN_KEY[0].bit6  
#define  Electric         CAN_KEY[0].bit7  
#define  Tradition        CAN_KEY[0].bit8  

#define  High_Voltage     CAN_KEY[1].bit5
#define  Charge_Check     CAN_KEY[1].bit6  

//#define  Kt               CAN_KEY[2].bit2  

#define  Brake_Pedal      CAN_KEY[3].bit1 
extern unsigned char Brake_percent; //制动踏板开度
extern unsigned char Speed_percent; //加速踏板开度
extern unsigned char Digit_input3;//数字量输入3

extern unsigned long Program;//程序版本
extern unsigned long tcu_spn; //TCU故障码
extern unsigned char tcu_fmi;
extern unsigned long tcu_cm; 
extern unsigned char tcu_oc;
extern unsigned char Car_LIFE;//整车控制器

extern unsigned int BMS_V; //电池电压
extern unsigned char BMS_SOC; //电池SOC
extern unsigned int BMS_A; //电池电流
extern unsigned char Status_Flag1;
extern unsigned char Status_Flag2;
extern unsigned char Status_Flag3;

extern unsigned int BMS_A_charge; //最大充电电流
extern unsigned int BMS_A_discharge; //最大电流
extern unsigned char Warn_level;//故障等级
extern unsigned int BMS_V_average; //电池平均电压
extern unsigned char BMS_T_H;//电池最高温度

extern unsigned int Oum_zheng; //绝缘正阻值
extern unsigned int Oum_fu; //绝缘负阻值
extern unsigned int Battery_single_H; //电池单体高电压
extern unsigned int Battery_single_L; //电池单体低电压

extern unsigned char Battery_number[10];//电池编号
extern unsigned int Battery_voltage[10];//电池单体电压

extern unsigned char Battery_number_t[10];//电池温度编号
extern unsigned int Battery_temp[10];//电池单体温度

extern unsigned int DCAC_W;
extern unsigned int DCAC_V;
extern unsigned int DCAC_U;
extern unsigned char Sanreqi_t;//散热器温度
extern unsigned char DCAC_Warn_code;//故障代码

extern unsigned char AC_Warn_code;//AC故障代码
extern DATA_BIT AC_KEY[2];
#define  AC_opean         AC_KEY[0].bit6
#define  AC_mind_speed    AC_KEY[0].bit7
#define  AC_High_speed    AC_KEY[0].bit8

#define  AC_warn1         AC_KEY[1].bit1
#define  AC_cold1_shuang  AC_KEY[1].bit2
#define  AC_wind          AC_KEY[1].bit3
#define  AC_save          AC_KEY[1].bit4
#define  AC_cold2_shuang  AC_KEY[1].bit5
#define  AC_cold2         AC_KEY[1].bit6
#define  AC_cold1         AC_KEY[1].bit8
extern unsigned char Indoor_t;//室内温度
extern unsigned char Outdoor_t;//室外温度
extern unsigned char Set_t;//设定
extern unsigned char AC_req;//制冷请求
extern unsigned char AC_LIFE;//AC生命

extern unsigned char battle_t; //电池均温
extern unsigned char battle_t_warn; //电池过温报警
extern unsigned char battle_jueyuan_warn; //绝缘过低报警
extern unsigned char battle_higtv1_warn; //高压电池1故障
extern unsigned char battle_higtv2_warn; //高压电池2故障
extern unsigned char moto_t_warn; //电机过温
extern unsigned char moto_ready; //ready信号
extern unsigned char xudc; //蓄电池异常
extern unsigned char moto_warn; //电机故障

